import React, { useEffect, useState } from "react";
import { Modal } from "antd";
import { useTranslation } from "react-i18next";
import { Link } from "react-router-dom";
import classes from '../DistributionOfLessonHours.module.css';

const BonusInfoModal = (props) => {
    const { t } = useTranslation();

    const bonusInfoArray = [
        {
            id: 1,
            article: "Вазирлар Маҳкамасининг 2019 йил 30 сентябрдаги 823-сон қарори",
            percentage: "10 фоиздан — 40 фоизгача  (10, 15, 20, 25, 30, 35, 40 фоизларда белгиланади)",
            employeeCategory: "Педагог, Психолог,  Кутубхона ходимларига тегишлилиги бўйича фоизларда белгиланади.",
            link: "https://lex.uz/docs/4532496",
            fixedClause: "6-боб: 21, 22, 23-бандлар;",
        },
        {
            id: 2,
            article: "Вазирлар Маҳкамасининг 2019 йил 30 сентябрдаги 823-сон қарори",
            percentage: "10 фоиз фоиз белгиланади",
            employeeCategory: "Фан йўналишлари бўйича услубий бирлашма раҳбарларига белгиланади.",
            link: "https://lex.uz/docs/4532496",
            fixedClause: "7-боб: 26-банд;",
        },
        {
            id: 3,
            article: "Ўзбекистон Республикаси Президентининг 10.12.2012 йилдаги ПҚ-1875-сон қарори",
            percentage: "қишлоқ жойларда жойлашган таълим муассасаларида 30 фоиз, бошқа жойларда 15 фоиз белгиланади",
            employeeCategory: "Чет тили ўқитувчиларига (рус тилидан ташқари) белгиланади.",
            link: "https://lex.uz/docs/2126032",
            fixedClause: "7-банд.",
        },
        {
            id: 4,
            article: "Ўзбекистон Республикаси Вазирлар Маҳкамасининг 07.08.2008 йилдаги 173-сон қарори",
            percentage: "20 ва 50 фоиз белгиланади",
            employeeCategory: "Айрим фанлар чуқур ўрганиладиган давлат ихтисослаштирилган умумтаълим муассасаларида ўқитувчиларига, ўқув жараёни билан бевосита боғлиқ бўлган директорлар ва ўқув ишлари бўйича ўринбосарига белгиланади.",
            link: "https://lex.uz/docs/1382066",
            fixedClause: "8-банд иккинчи ва бешинчи хатбоши;",
        },
        {
            id: 5,
            article: "Ўзбекистон Республикаси Президентининг 01.04.2010 йилдаги ПҚ-1315-сон қарори",
            percentage: "Қишлоқ жойларда жойлашган таълим муассасаларида 15 фоиз белгиланади",
            employeeCategory: "Қишлоқ жойлардаги умумтаълим мактабларида жисмоний тарбия ўқитувчиси бўлиб ишлаётган аёллар учун белгиланади.",
            link: "https://lex.uz/docs/1606175",
            fixedClause: "1-банд.",
        },
        {
            id: 6,
            article: "Ўзбекистон Республикаси Вазирлар Маҳкамасининг 06.09.2019 йилдаги 743-сон  қарори",
            percentage: "10 фоиздан — 60 фоизгача (10, 15, 20, 30, 40, 50 ва 60 фоизларда белгиланади)",
            employeeCategory: "Табиий-иқлим ва маиший шароитлари оғир ва ноқулай бўлган жойларда ишловчи ходимлар учун белгиланади. (2-листда тегишли туманлар рўйхати илова қилинади)",
            link: "https://lex.uz/docs/4502806",
            fixedClause: "Низомнинг 1-илова: Рўйхати.",
        },
        {
            id: 7,
            article: "Ўзбекистон Республикаси Вазирлар Маҳкамасининг 07.06.2019 йилдаги 471-сон  қарори",
            percentage: "10 фоиздан — 50 фоизгача (10, 20, 30, 40 ва 50 фоизларда белгиланади)",
            employeeCategory: "Олис ҳудудларда жойлашган умумий ўрта таълим муассасаларида бошқа ҳудудлардан келиб фаолият юритаётган педагог ходимларнинг базавий тариф ставкаларига иш стажидан келиб чиқиб белгиланади. (3-листда тегишли туманлар рўйхати илова қилинади)",
            link: "https://lex.uz/docs/4367859",
            fixedClause: "Қарорнинг 2-илова: Миқдорлари.",
        },
        {
            id: 8,
            article: "Ўзбекистон Республикаси Президентининг 03.05.2019 йилдаги ПҚ-4306-сон қарори",
            percentage: "100 фоиз белгиланади",
            employeeCategory: "Асосий олимпиадалар республика босқичи ғолиблари бўлган ва ғолиб бўлган фани бўйича хозирда дарс берадиган педагог ходимларга белгиланади.",
            link: "https://lex.uz/docs/4320713",
            fixedClause: "5-банд; тўртинчи хатбоши.",
        },
        {
            id: 9,
            article: "Ўзбекистон Республикаси Вазирлар Маҳкамасининг 03.01.2008 йилдаги 2-сон қарори",
            percentage: "Базавий ҳисоблаш миқдорининг 1,6— 3 бараваригача (1,6-1,8 ва 3 баравари белгиланади)",
            employeeCategory: "Фахрий унвонга эга педагог ходимларга белгиланади.",
            link: "https://lex.uz/docs/1297848",
            fixedClause: "1-боб: 2-банд.",
        },
        {
            id: 10,
            article: "Вазирлар Маҳкамасининг 2019 йил 30 сентябрдаги 823-сон қарори",
            percentage: "100 фоиз фоиз белгиланади",
            employeeCategory: "Қорақалпоғистон Республикаси Халқ таълими вазирлиги, Тошкент шаҳар халқ таълими бош бошқармаси ва вилоятлар халқ таълими бошқармаларининг ташқи мониторинг натижаларига кўра, ўқувчилар ўртача 80 фоиздан кам бўлмаган кўрсаткичга эга бўлган педагог ходимларга белгиланади.",
            link: "https://lex.uz/docs/4532496?ONDATE=31.12.2020%2000#5207930",
            fixedClause: "7-боб: 27-банд.",
        },
        {
            id: 11,
            article: "Ўзбекистон Республикаси Вазирлар Маҳкамасининг 11.08.2003 йилдаги 347-сон қарори",
            percentage: "20 фоиз фоиз белгиланади",
            employeeCategory: "Ўзбекистон Республикаси Вазирлар Маҳкамаси ҳузуридаги Тошкент ислом университетини битириб, ишлаётган ходимларга белгиланади.",
            link: "https://lex.uz/docs/837202",
            fixedClause: "1-банд.",
        },
        {
            id: 12,
            article: "Ўзбекистон Республикаси Меҳнат ва аҳолини ижтимоий муҳофаза қилиш вазирлиги, Ўзбекистон Республикаси Молия вазирлигининг 13.04.2001 йилда рўйхатдан ўтган, рўйхат рақами 1026-сонли қарор",
            percentage: "25 фоиздан — 75 фоизгача (25, 50 ва 75 фоизларда белгиланади)",
            employeeCategory: "Учқудуқ, Зарафшон, Нуробод шаҳарлари ва шаҳар типидаги Зафаробод посёлкаси бюджет ташкилотлари ходимларига муайян давр ишлаганлик учун белгиланади. (4-листда тегишли мактаблар рўйхати илова қилинади).",
            link: "https://lex.uz/docs/800224",
            fixedClause: "Низомнинг 1-банди.",
        },
        {
            id: 13,
            article: "Ўзбекистон Республикаси Вазирлар Маҳкамасининг 21.12.2005 йилдаги 275-сон қарори",
            percentage: "17,6 фоиз фоиз белгиланади",
            employeeCategory: "Информатика фани ўқитувчиси (мутахасис бўлмаган тақдирда математика фани ўқитувчиси) учун белгиланади.",
            link: "hthttps://lex.uz/docs/941876",
            fixedClause: "Қарорнинг 3-илова: 4-банди учинчи хатбоши.",
        },
        {
            id: 14,
            article: "Ўзбекистон Республикаси Вазирлар Маҳкамасининг 15.10.2021 йилдаги 646-сон қарори",
            percentage: "50 ва 100 фоиз белгиланади",
            employeeCategory: "Таълим даражаси юқори бўлмаган мактабларда дарс бериш учун бошқа ҳудудлардан жалб қилинган олий ва биринчи тоифага эга ўқитувчи-педагоглар учун белгиланади.",
            link: "https://lex.uz/docs/5679889",
            fixedClause: "1-банд иккинчи ва учинчи хатбоши.",
        },
        {
            id: 15,
            article: "Ўзбекистон Республикаси Президентининг 11.05.2022 йилдаги ПФ-134-сон қарори",
            percentage: "50 фоиз фоиз белгиланади",
            employeeCategory: "Умумтаълим фанлари бўйича тегишли даражадаги сертификатга эга бўлган педагог кадрларга ҳар ойлик қўшимча устама белгиланади. (чет тили, рус тили, физика кимё, биология, информатика, математика, она тили)",
            link: "https://lex.uz/docs/6008663",
            fixedClause: "9-банд.",
        },
        {
            id: 16,
            article: "Ўзбекистон Республикаси Вазирлар Маҳкамасининг қарори, 24.12.2019 йилдаги 1030-сон қарори",
            percentage: "30 ва 60 фоиз белгиланади",
            employeeCategory: "Фан номзоди ёки фалсафа доктори (PhD) ва фан доктори (Doctor of Science) илмий даражасига эга педагоглар учун белгиланади.",
            link: "https://lex.uz/docs/4662181",
            fixedClause: "1-банд биринчи ва иккинчи хатбоши",
        },
        {
            id: 17,
            article: "Ўзбекистон Республикаси Президентининг 13.07.2021 йилдаги ПФ-6260-сон Фармони",
            percentage: "15 фоиздан — 75 фоизгача (15, 20, 30, 40, 50, 60 ва 75 фоизларда белгиланади)",
            employeeCategory: "Нуфузли халқаро рейтинг ташкилотларининг юқори 500 талик рўйхатига киритилган хорижий олий таълим муассасаларини (бакалавриат, магистратура) тамомлаган ёки уларда илмий даража (PhD ва унга тенглаштирилган бошқа илмий даража) олган педогог ходимлар учун белгиланади.",
            link: "https://lex.uz/docs/5512119",
            fixedClause: "Фармоннинг 1-илова: Миқдорлари.",
        },
        {
            id: 18,
            article: "Ўзбекистон Республикаси Вазирлар Маҳкамасининг 12.10.2021 йилдаги 638-сон қарори",
            percentage: "10 фоиздан — 50 фоизгача 10, 20, 30, 40 ва 50 фоизларда белгиланади)",
            employeeCategory: "Инклюзив таълим синфлари ўқитувчиларига меҳнатнинг алоҳида шароитлари учун белгиланади.",
            link: "https://lex.uz/docs/5679836 ",
            fixedClause: "Қарор билан тасдиқланган Низомнинг 8-боб: 53-банд.",
        },
    ];

    const thisInfo = bonusInfoArray.find(item => item.id === props.id)

    return (
        <Modal
            title={t("Ўзбекистон Республикаси Халқ таълими вазирлиги тизимидаги умумтаълим муассасаларида фаолият олиб бораётган ходимлар учун тўланиши мумкин бўлган устама ва бошқа тўлов турлари тўғрисидаги МАЪЛУМОТ")}
            visible={props.visible}
            cancelText={t("cancel")}
            onCancel={props.onCancel}
            width={900}
            okButtonProps={{ style: { display: 'none' } }}
        >
            <div className={classes.orgInfo}>
                <div className={classes.key}>{t("Устама ҳақ тўланишини белгиловчи ҳуқуқий асос")}: </div><div className={classes.value}>{thisInfo.article}</div>
            </div>
            <div className={classes.orgInfo}>
                <div className={classes.key}>{t("Устама ҳақ миқдори (Базавий тариф ставкаларига фоизда ёки БҲМ баробарида)")}: </div><div className={classes.value}>{thisInfo.percentage}</div>
            </div>
            <div className={classes.orgInfo}>
                <div className={classes.key}>{t("Тадбиқ қилинадиган ходимлар тоифаси")}: </div><div className={classes.value}>{thisInfo.employeeCategory}</div>
            </div>
            <div className={classes.orgInfo}>
                <div className={classes.key}>{t("Устама ҳақ тўланишини белгиловчи ҳуқуқий асос")}: </div><Link to={thisInfo.link} className={classes.value}>{thisInfo.link}</Link>
            </div>
            <div className={classes.orgInfo}>
                <div className={classes.key}>{t("Норматив-ҳуқуқий хужжатда белгиланган банд")}: </div><div className={classes.value}>{thisInfo.fixedClause}</div>
            </div>
        </Modal >
    )
}

export default BonusInfoModal;